VictorTagayun/STM32_INA239-INA229/NUCLEO-G474RE_INA239-INA229_DMA-DAC_HRTIM-SyncBuck/Core/Src/main.c
  /*Configure GPIO pins : PC6 PC8 PC9 */
  GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_8|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : PD2 */
  GPIO_InitStruct.Pin = GPIO_PIN_2;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : PB9 */
  GPIO_InitStruct.Pin = GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI2_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI2_IRQn);

  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */

void SPI_DMA_TXRX(void)
{

	GPIOC->BSRR = (1<<8); // Set

	printf("SPI_DMA_TXRX \n");

	HAL_SPI_TxRxCpltCallback_finished = 0;

	for(uint16_t cntr = 0; cntr < INA229_msg_lenght_cntr ; cntr++)
	{
		printf("INA229_send_packet[%d] = %x \n", cntr , INA229_send_packet[cntr]);
	}

	//	for (uint8_t cntr = 0; cntr < INA229_msg_lenght_cntr; cntr++)
	//	{
	//
	//		if (INA229_send_packet_decoder[cntr] != 0) // decode
	//		{
	//			INA229_decodedAddress = INA229_send_packet_decoder[cntr] - 1;
	//			printf("INA229_send_packet_decoder[%d] = %x \n", cntr , INA229_decodedAddress);
	//			switch(INA229_decodedAddress)
	//			{
	//			case INA229_REG_CONFIG: // 00h, 2 bytes
	//				INA229_REG_CONFIG_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_CONFIG_val = %x \n", INA229_REG_CONFIG_val);
	//				break;
	//			case INA229_REG_ADC_CONFIG: // 01h, 2 bytes
	//				INA229_REG_ADC_CONFIG_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_ADC_CONFIG_val = %x \n", INA229_REG_ADC_CONFIG_val);
	//				break;
	//			case INA229_REG_SHUNT_CAL: // 02h, 2 bytes
	//				INA229_REG_SHUNT_CAL_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_SHUNT_CAL_val = %x \n", INA229_REG_SHUNT_CAL_val);
	//				break;
	//			case INA229_REG_SHUNT_TEMPCO: // 03h, 2 bytes
	//				INA229_REG_SHUNT_TEMPCO_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_SHUNT_TEMPCO_val = %x \n", INA229_REG_SHUNT_TEMPCO_val);
	//				break;
	//			case INA229_REG_VSHUNT: // 04h, 3 bytes
	//				INA229_REG_VSHUNT_val = combine_3_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3]);
	//				printf("INA229_REG_VSHUNT_val = %x \n", INA229_REG_VSHUNT_val);
	//				break;
	//			case INA229_REG_VBUS: // 05h, 3 bytes
	//				INA229_REG_VBUS_val = combine_3_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3]);
	//				printf("INA229_REG_VBUS_val = %x \n", INA229_REG_VBUS_val);
	//				break;
	//			case INA229_REG_DIETEMP: //06h, 2 bytes
	//				INA229_REG_DIETEMP_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_DIETEMP_val = %x \n", INA229_REG_DIETEMP_val);
	//				break;
	//			case INA229_REG_CURRENT: // 07h, 3 bytes
	//				INA229_REG_CURRENT_val = combine_3_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3]);
	//				printf("INA229_REG_CURRENT_val = %x \n", INA229_REG_CURRENT_val);
	//				break;
	//			case INA229_REG_POWER: // 08h, 3 bytes
	//				INA229_REG_POWER_val = combine_3_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3]);
	//				printf("INA229_REG_POWER_val = %x \n", INA229_REG_POWER_val);
	//				break;
	//			case INA229_REG_ENERGY: // 09h, 5 bytes
	//				INA229_REG_ENERGY_val = combine_5_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3], INA229_recv_packet[cntr + 4], INA229_recv_packet[cntr + 5]);
	//				printf("INA229_REG_ENERGY_val = %x%08x \n", INA229_REG_ENERGY_val);
	//				break;
	//			case INA229_REG_CHARGE: // 0ah, 5 bytes
	//				INA229_REG_CHARGE_val = combine_5_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2], INA229_recv_packet[cntr + 3], INA229_recv_packet[cntr + 4], INA229_recv_packet[cntr + 5]);
	//				printf("INA229_REG_CHARGE_val = %x%08x \n", INA229_REG_CHARGE_val);
	//				break;
	//			case INA229_REG_DIAG_ALRT: // 0bh
	//				INA229_REG_DIAG_ALRT_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_DIAG_ALRT_val = %x \n", INA229_REG_DIAG_ALRT_val);
	//				break;
	//			case INA229_REG_SOVL: // 0ch
	//				INA229_REG_SOVL_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_SOVL_val = %x \n", INA229_REG_SOVL_val);
	//				break;
	//			case INA229_REG_SUVL:
	//				INA229_REG_SUVL_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_SUVL_val = %x \n", INA229_REG_SUVL_val);
	//				break;
	//			case INA229_REG_BOVL:
	//				INA229_REG_BOVL_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_BOVL_val = %x \n", INA229_REG_BOVL_val);
	//				break;
	//			case INA229_REG_BUVL:
	//				INA229_REG_BUVL_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_BUVL_val = %x \n", INA229_REG_BUVL_val);
	//				break;
	//			case INA229_REG_TEMP_LIMIT:
	//				INA229_REG_TEMP_LIMIT_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_TEMP_LIMIT_val = %x \n", INA229_REG_TEMP_LIMIT_val);
	//				break;
	//			case INA229_REG_PWR_LIMIT:
	//				INA229_REG_PWR_LIMIT_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_PWR_LIMIT_val = %x \n", INA229_REG_PWR_LIMIT_val);
	//				break;
	//			case INA229_REG_MANUFACTURER_ID:
	//				INA229_REG_MANUFACTURER_ID_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_MANUFACTURER_ID_val = %x \n", INA229_REG_MANUFACTURER_ID_val);
	//				break;
	//			case INA229_REG_DEVICE_ID:
	//				INA229_REG_DEVICE_ID_val = combine_2_bytes(INA229_recv_packet[cntr + 1], INA229_recv_packet[cntr + 2]);
	//				printf("INA229_REG_DEVICE_ID_val = %x \n", INA229_REG_DEVICE_ID_val);
	//				break;
	//			default:
	//				break;
	//
	//			}
	//
	//		} else
	//		{
	//			printf("INA229_send_packet[%d] = %x \n", cntr , INA229_send_packet[cntr]);
	//		}
	//	}

	// SPI DMA TX-RX
	switch (HAL_SPI_TransmitReceive_DMA(&hspi3, (uint8_t*) INA229_send_packet, (uint8_t*) INA229_recv_packet, INA229_msg_lenght_cntr))
	{
	case HAL_OK:
		/* Communication is completed ___________________________________________ */
		break;
	case HAL_TIMEOUT:
		/* An Error Occur ______________________________________________________ */
		printf("SPI HAL_TIMEOUT \n");
	case HAL_ERROR:
		/* Call Timeout Handler */
		printf("SPI HAL_ERROR \n");
		Error_Handler();
		break;
	default:
		break;
	}

	GPIOC->BRR = (1<<8); // Reset

	while(!HAL_SPI_TxRxCpltCallback_finished)
	{
	}

