VictorTagayun/STM32_INA239-INA229/NUCLEO-G474RE_INA239-INA229_DMA-DAC_HRTIM-SyncBuck/Core/Src/main.c
			}

		} else
		{
			printf("INA229_recv_packet[%d] = %x \n", cntr , INA229_recv_packet[cntr]);
		}
	}

	HAL_SPI_TxRxCpltCallback_finished = 1;
	VT_INA229_ResetVars();

	GPIOC->BRR = (1<<6); // Reset
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	/* Prevent unused argument(s) compilation warning */
	UNUSED(huart);

	/* NOTE : This function should not be modified, when the callback is needed,
            the HAL_UART_RxCpltCallback can be implemented in the user file.
	 */
	HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);

	//	printf("HAL_UART_RxCpltCallback = %x \n", UartRxBuffer[0]);

	switch(UartRxBuffer[0])
	{
	case 0x30: // 0
		INA229_Write_CONFIG(INA229_REG_CFG_RESET);
		SPI_DMA_TXRX();
		break;
	case 0x31: // 1
		VT_INA229_ReadAllReg();
		SPI_DMA_TXRX();
		break;
	case 0x32:
		INA229_Write_DIAG_ALERT(INA229_REG_DIAG_ALERT_CNVR);
		SPI_DMA_TXRX();
		//		INA229_Write_ADC_CONFIG(INA229_MODE_CONTINOUS_VSHUNT | INA229_VBUSCT_50 | INA229_VSHCT_50 | INA229_VTCT_50 | INA229_AVG_1);
		//		SPI_DMA_TXRX();
		//		for(uint16_t mS = 0; mS < 3; mS++)
		//		{
		//			for(uint16_t nS = 0; nS < 1000; nS++)
		//			{
		//				for(uint16_t i = 0; i < 13; i++)
		//				{}
		//			}
		//		}
		//		INA229_Write_DIAG_ALERT(INA229_REG_DIAG_ALERT_CNVR);
		//		SPI_DMA_TXRX();
		break;
	case 0x33:
		INA229_Write_ADC_CONFIG(INA229_MODE_CONTINOUS_VBUS_VSHUNT | INA229_VBUSCT_50 | INA229_VSHCT_50 | INA229_VTCT_50 | INA229_AVG_1);
		SPI_DMA_TXRX();
		//		for(uint16_t mS = 0; mS < 3; mS++)
		//		{
		//			for(uint16_t nS = 0; nS < 1000; nS++)
		//			{
		//				for(uint16_t i = 0; i < 13; i++)
		//				{}
		//			}
		//		}
		//		INA229_Write_DIAG_ALERT(INA229_REG_DIAG_ALERT_CNVR);
		//		SPI_DMA_TXRX();
		break;
	case 0x34:
		VT_INA229_ReadReg(INA229_REG_DIAG_ALRT);
		SPI_DMA_TXRX();
		break;
	case 0x35:
		VT_INA229_ReadReg(INA229_REG_VSHUNT);
		SPI_DMA_TXRX();
		break;
	case 0x36:
		VT_INA229_ReadReg(INA229_REG_VSHUNT);
		INA229_Write_DIAG_ALERT(INA229_REG_DIAG_ALERT_CNVR);
		SPI_DMA_TXRX();
		break;
	case 0x37:
		VT_INA229_ReadReg(INA229_REG_VSHUNT);
		INA229_Write_DIAG_ALERT(INA229_REG_DIAG_ALERT_CNVR | INA229_REG_DIAG_ALERT_CNVRF | INA229_REG_DIAG_ALERT_MEMSTAT);
		SPI_DMA_TXRX();
		break;
	case 0x38:
		printf("HAL_UART_RxCpltCallback = %x \n", UartRxBuffer[0]);
		break;
	case 0x39: // 9
		printf("case 0x39: \n");
		VT_INA229_ReadAllReg();
		SPI_DMA_TXRX();
		VT_INA229_ReadAllReg();
		SPI_DMA_TXRX();
		break;
	case 0x61: // a
		printf("HAL_UART_RxCpltCallback = %x \n", UartRxBuffer[0]);
		break;
	case 0x62: // b
		printf("HAL_UART_RxCpltCallback = %x \n", UartRxBuffer[0]);
		break;
	case 0x63: // c
		printf("HAL_UART_RxCpltCallback = %x \n", UartRxBuffer[0]);
		break;
	default: // None
		printf("No data found! \n");
		break;
	}

}

//void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
//{
//	/* Prevent unused argument(s) compilation warning */
//	UNUSED(hspi);
//
//	/* NOTE : This function should not be modified, when the callback is needed,
//            the HAL_SPI_RxCpltCallback should be implemented in the user file
//	 */
//
//	printf("HAL_SPI_RxCpltCallback \n");
//
//}


//void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi)
//{
//	/* Prevent unused argument(s) compilation warning */
//	UNUSED(hspi);
//
//	/* NOTE : This function should not be modified, when the callback is needed,
//            the HAL_SPI_RxCpltCallback should be implemented in the user file
//	 */
//
//	printf("HAL_SPI_RxHalfCpltCallback \n");
//
//}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	printf("Error_Handler \n");
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, SET);
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
